from PyQt6.QtCore import pyqtSignal
from PyQt6.QtWidgets import QLabel

from typing import Any

class QLabelAdvertisement(QLabel):
    """Контейнер рекламной анимации."""

    #==========================================================================================#
	# >>>>> СТАТИЧЕСКИЕ АТРИБУТЫ <<<<< #
	#==========================================================================================#

    clicked = pyqtSignal()

    #==========================================================================================#
	# >>>>> ПУБЛИЧНЫЕ МЕТОДЫ <<<<< #
	#==========================================================================================#

    def mousePressEvent(self, value: Any):
        self.clicked.emit()